MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB406/mcu.h
extern volatile SPI3IMSKHBITS SPI3IMSKHbits __attribute__((__sfr__));

#define SPI3URDTL SPI3URDTL
extern volatile uint16_t SPI3URDTL __attribute__((__sfr__));
__extension__ typedef struct tagSPI3URDTLBITS {
  union {
    struct {
      uint16_t SPI3URDTL:16;
    };
    struct {
      uint16_t URDATA:16;
    };
  };
} SPI3URDTLBITS;
extern volatile SPI3URDTLBITS SPI3URDTLbits __attribute__((__sfr__));

#define SPI3URDTH SPI3URDTH
extern volatile uint16_t SPI3URDTH __attribute__((__sfr__));
__extension__ typedef struct tagSPI3URDTHBITS {
  union {
    struct {
      uint16_t SPI3URDTH:16;
    };
    struct {
      uint16_t URDATA:16;
    };
  };
} SPI3URDTHBITS;
extern volatile SPI3URDTHBITS SPI3URDTHbits __attribute__((__sfr__));

#define SPI4CON1 SPI4CON1
extern volatile uint16_t SPI4CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSPI4CON1BITS {
  union {
    struct {
      uint16_t ENHBUF:1;
      uint16_t SPIFE:1;
      uint16_t MCLKEN:1;
      uint16_t DISSCK:1;
      uint16_t DISSDI:1;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t MODE32:1;
      uint16_t DISSDO:1;
      uint16_t SPISIDL:1;
      uint16_t :1;
      uint16_t SPIEN:1;
    };
    struct {
      uint16_t :10;
      uint16_t MODE:2;
    };
  };
} SPI4CON1BITS;
extern volatile SPI4CON1BITS SPI4CON1bits __attribute__((__sfr__));

#define SPI4CON1L SPI4CON1L
extern volatile uint16_t SPI4CON1L __attribute__((__sfr__));
__extension__ typedef struct tagSPI4CON1LBITS {
  union {
    struct {
      uint16_t ENHBUF:1;
      uint16_t SPIFE:1;
      uint16_t MCLKEN:1;
      uint16_t DISSCK:1;
      uint16_t DISSDI:1;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t MODE32:1;
      uint16_t DISSDO:1;
      uint16_t SPISIDL:1;
      uint16_t :1;
      uint16_t SPIEN:1;
    };
    struct {
      uint16_t :10;
      uint16_t MODE:2;
    };
  };
} SPI4CON1LBITS;
extern volatile SPI4CON1LBITS SPI4CON1Lbits __attribute__((__sfr__));

#define SPI4CON1H SPI4CON1H
extern volatile uint16_t SPI4CON1H __attribute__((__sfr__));
__extension__ typedef struct tagSPI4CON1HBITS {
  union {
    struct {
      uint16_t FRMCNT:3;
      uint16_t FRMSYPW:1;
      uint16_t MSSEN:1;
      uint16_t FRMPOL:1;
      uint16_t FRMSYNC:1;
      uint16_t FRMEN:1;
      uint16_t AUDMOD:2;
      uint16_t URDTEN:1;
      uint16_t AUDMONO:1;
      uint16_t IGNTUR:1;
      uint16_t IGNROV:1;
      uint16_t SPISGNEXT:1;
      uint16_t AUDEN:1;
    };
    struct {
      uint16_t FRMCNT0:1;
      uint16_t FRMCNT1:1;
      uint16_t FRMCNT2:1;
      uint16_t :5;
      uint16_t AUDMOD0:1;
      uint16_t AUDMOD1:1;
    };
  };
} SPI4CON1HBITS;
extern volatile SPI4CON1HBITS SPI4CON1Hbits __attribute__((__sfr__));

#define SPI4CON2 SPI4CON2
extern volatile uint16_t SPI4CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSPI4CON2BITS {
  union {
    struct {
      uint16_t FRMCNT:3;
      uint16_t FRMSYPW:1;
      uint16_t MSSEN:1;
      uint16_t FRMPOL:1;
      uint16_t FRMSYNC:1;
      uint16_t FRMEN:1;
      uint16_t AUDMOD:2;
      uint16_t URDTEN:1;
      uint16_t AUDMONO:1;
      uint16_t IGNTUR:1;
      uint16_t IGNROV:1;
      uint16_t SPISGNEXT:1;
      uint16_t AUDEN:1;
    };
    struct {
      uint16_t FRMCNT0:1;
      uint16_t FRMCNT1:1;
      uint16_t FRMCNT2:1;
      uint16_t :5;
      uint16_t AUDMOD0:1;
      uint16_t AUDMOD1:1;
    };
  };
} SPI4CON2BITS;
extern volatile SPI4CON2BITS SPI4CON2bits __attribute__((__sfr__));

#define SPI4CON2L SPI4CON2L
extern volatile uint16_t SPI4CON2L __attribute__((__sfr__));
typedef struct tagSPI4CON2LBITS {
  uint16_t WLENGTH:5;
} SPI4CON2LBITS;
extern volatile SPI4CON2LBITS SPI4CON2Lbits __attribute__((__sfr__));

#define SPI4CON3 SPI4CON3
extern volatile uint16_t SPI4CON3 __attribute__((__sfr__));
typedef struct tagSPI4CON3BITS {
  uint16_t WLENGTH:5;
} SPI4CON3BITS;
extern volatile SPI4CON3BITS SPI4CON3bits __attribute__((__sfr__));

#define SPI4CON2H SPI4CON2H
extern volatile uint16_t SPI4CON2H __attribute__((__sfr__));
#define SPI4CON4 SPI4CON4
extern volatile uint16_t SPI4CON4 __attribute__((__sfr__));

#define SPI4 SPI4
extern volatile SPI SPI4 __attribute__((__sfr__));

#define SPI4STATL SPI4STATL
extern volatile uint16_t SPI4STATL __attribute__((__sfr__));
typedef struct tagSPI4STATLBITS {
  uint16_t SPIRBF:1;
  uint16_t SPITBF:1;
  uint16_t :1;
  uint16_t SPITBE:1;
  uint16_t :1;
  uint16_t SPIRBE:1;
  uint16_t SPIROV:1;
  uint16_t SRMT:1;
  uint16_t SPITUR:1;
  uint16_t :2;
  uint16_t SPIBUSY:1;
  uint16_t FRMERR:1;
} SPI4STATLBITS;
extern volatile SPI4STATLBITS SPI4STATLbits __attribute__((__sfr__));


#define SPI4 SPI4
extern volatile SPI SPI4 __attribute__((__sfr__));

#define SPI4STATH SPI4STATH
extern volatile uint16_t SPI4STATH __attribute__((__sfr__));
__extension__ typedef struct tagSPI4STATHBITS {
  union {
    struct {
      uint16_t TXELM:6;
      uint16_t :2;
      uint16_t RXELM:6;
    };
    struct {
      uint16_t TXELM0:1;
      uint16_t TXELM1:1;
      uint16_t TXELM2:1;
      uint16_t TXELM3:1;
      uint16_t TXELM4:1;
      uint16_t TXELM5:1;
      uint16_t :2;
      uint16_t RXELM0:1;
      uint16_t RXELM1:1;
      uint16_t RXELM2:1;
      uint16_t RXELM3:1;
      uint16_t RXELM4:1;
      uint16_t RXELM5:1;
    };
  };
} SPI4STATHBITS;
extern volatile SPI4STATHBITS SPI4STATHbits __attribute__((__sfr__));

#define SPI4BUFL SPI4BUFL
extern volatile uint16_t SPI4BUFL __attribute__((__sfr__));
__extension__ typedef struct tagSPI4BUFLBITS {
  union {
    struct {
      uint16_t SPI4BUFL:16;
    };
    struct {
      uint16_t DATA:16;
    };
  };
} SPI4BUFLBITS;
extern volatile SPI4BUFLBITS SPI4BUFLbits __attribute__((__sfr__));

#define SPI4BUFH SPI4BUFH
extern volatile uint16_t SPI4BUFH __attribute__((__sfr__));
__extension__ typedef struct tagSPI4BUFHBITS {
  union {
    struct {
      uint16_t SPI4BUFH:16;
    };
    struct {
      uint16_t DATA:16;
    };
  };
} SPI4BUFHBITS;
extern volatile SPI4BUFHBITS SPI4BUFHbits __attribute__((__sfr__));

#define SPI4BRGL SPI4BRGL
extern volatile uint16_t SPI4BRGL __attribute__((__sfr__));
__extension__ typedef struct tagSPI4BRGLBITS {
  union {
    struct {
      uint16_t SPI4BRGL:13;
    };
    struct {
      uint16_t BRG:13;
    };
  };
} SPI4BRGLBITS;
