MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB406/mcu.h
extern volatile LCDDATA3BITS LCDDATA3bits __attribute__((__sfr__));

#define LCDDATA4 LCDDATA4
extern volatile uint16_t LCDDATA4 __attribute__((__sfr__));
typedef struct tagLCDDATA4BITS {
  uint16_t S00C1:1;
  uint16_t S01C1:1;
  uint16_t S02C1:1;
  uint16_t S03C1:1;
  uint16_t S04C1:1;
  uint16_t S05C1:1;
  uint16_t S06C1:1;
  uint16_t S07C1:1;
  uint16_t S08C1:1;
  uint16_t S09C1:1;
  uint16_t S10C1:1;
  uint16_t S11C1:1;
  uint16_t S12C1:1;
  uint16_t S13C1:1;
  uint16_t S14C1:1;
  uint16_t S15C1:1;
} LCDDATA4BITS;
extern volatile LCDDATA4BITS LCDDATA4bits __attribute__((__sfr__));

#define LCDDATA5 LCDDATA5
extern volatile uint16_t LCDDATA5 __attribute__((__sfr__));
typedef struct tagLCDDATA5BITS {
  uint16_t S16C1:1;
  uint16_t S17C1:1;
  uint16_t S18C1:1;
  uint16_t S19C1:1;
  uint16_t S20C1:1;
  uint16_t S21C1:1;
  uint16_t S22C1:1;
  uint16_t S23C1:1;
  uint16_t S24C1:1;
  uint16_t S25C1:1;
  uint16_t S26C1:1;
  uint16_t S27C1:1;
  uint16_t S28C1:1;
  uint16_t S29C1:1;
  uint16_t S30C1:1;
  uint16_t S31C1:1;
} LCDDATA5BITS;
extern volatile LCDDATA5BITS LCDDATA5bits __attribute__((__sfr__));

#define LCDDATA6 LCDDATA6
extern volatile uint16_t LCDDATA6 __attribute__((__sfr__));
typedef struct tagLCDDATA6BITS {
  uint16_t S32C1:1;
  uint16_t S33C1:1;
  uint16_t S34C1:1;
  uint16_t S35C1:1;
  uint16_t S36C1:1;
  uint16_t S37C1:1;
  uint16_t S38C1:1;
  uint16_t S39C1:1;
  uint16_t S40C1:1;
  uint16_t S41C1:1;
  uint16_t S42C1:1;
  uint16_t S43C1:1;
  uint16_t S44C1:1;
  uint16_t S45C1:1;
  uint16_t S46C1:1;
  uint16_t S47C1:1;
} LCDDATA6BITS;
extern volatile LCDDATA6BITS LCDDATA6bits __attribute__((__sfr__));

#define LCDDATA7 LCDDATA7
extern volatile uint16_t LCDDATA7 __attribute__((__sfr__));
typedef struct tagLCDDATA7BITS {
  uint16_t S48C1:1;
  uint16_t S49C1:1;
  uint16_t S50C1:1;
  uint16_t S51C1:1;
  uint16_t S52C1:1;
  uint16_t S53C1:1;
  uint16_t S54C1:1;
  uint16_t S55C1:1;
  uint16_t S56C1:1;
  uint16_t S57C1:1;
  uint16_t S58C1:1;
  uint16_t S59C1:1;
  uint16_t S60C1:1;
  uint16_t S61C1:1;
  uint16_t S62C1:1;
  uint16_t S63C1:1;
} LCDDATA7BITS;
extern volatile LCDDATA7BITS LCDDATA7bits __attribute__((__sfr__));

#define LCDDATA8 LCDDATA8
extern volatile uint16_t LCDDATA8 __attribute__((__sfr__));
typedef struct tagLCDDATA8BITS {
  uint16_t S00C2:1;
  uint16_t S01C2:1;
  uint16_t S02C2:1;
  uint16_t S03C2:1;
  uint16_t S04C2:1;
  uint16_t S05C2:1;
  uint16_t S06C2:1;
  uint16_t S07C2:1;
  uint16_t S08C2:1;
  uint16_t S09C2:1;
  uint16_t S10C2:1;
  uint16_t S11C2:1;
  uint16_t S12C2:1;
  uint16_t S13C2:1;
  uint16_t S14C2:1;
  uint16_t S15C2:1;
} LCDDATA8BITS;
extern volatile LCDDATA8BITS LCDDATA8bits __attribute__((__sfr__));

#define LCDDATA9 LCDDATA9
extern volatile uint16_t LCDDATA9 __attribute__((__sfr__));
typedef struct tagLCDDATA9BITS {
  uint16_t S16C2:1;
  uint16_t S17C2:1;
  uint16_t S18C2:1;
  uint16_t S19C2:1;
  uint16_t S20C2:1;
  uint16_t S21C2:1;
  uint16_t S22C2:1;
  uint16_t S23C2:1;
  uint16_t S24C2:1;
  uint16_t S25C2:1;
  uint16_t S26C2:1;
  uint16_t S27C2:1;
  uint16_t S28C2:1;
  uint16_t S29C2:1;
  uint16_t S30C2:1;
  uint16_t S31C2:1;
} LCDDATA9BITS;
extern volatile LCDDATA9BITS LCDDATA9bits __attribute__((__sfr__));

#define LCDDATA10 LCDDATA10
extern volatile uint16_t LCDDATA10 __attribute__((__sfr__));
typedef struct tagLCDDATA10BITS {
  uint16_t S32C2:1;
  uint16_t S33C2:1;
  uint16_t S34C2:1;
  uint16_t S35C2:1;
  uint16_t S36C2:1;
  uint16_t S37C2:1;
  uint16_t S38C2:1;
  uint16_t S39C2:1;
  uint16_t S40C2:1;
  uint16_t S41C2:1;
  uint16_t S42C2:1;
  uint16_t S43C2:1;
  uint16_t S44C2:1;
  uint16_t S45C2:1;
  uint16_t S46C2:1;
  uint16_t S47C2:1;
} LCDDATA10BITS;
extern volatile LCDDATA10BITS LCDDATA10bits __attribute__((__sfr__));

#define LCDDATA11 LCDDATA11
extern volatile uint16_t LCDDATA11 __attribute__((__sfr__));
typedef struct tagLCDDATA11BITS {
  uint16_t S48C2:1;
  uint16_t S49C2:1;
  uint16_t S50C2:1;
  uint16_t S51C2:1;
  uint16_t S52C2:1;
  uint16_t S53C2:1;
  uint16_t S54C2:1;
  uint16_t S55C2:1;
  uint16_t S56C2:1;
  uint16_t S57C2:1;
  uint16_t S58C2:1;
  uint16_t S59C2:1;
  uint16_t S60C2:1;
  uint16_t S61C2:1;
  uint16_t S62C2:1;
  uint16_t S63C2:1;
} LCDDATA11BITS;
extern volatile LCDDATA11BITS LCDDATA11bits __attribute__((__sfr__));

#define LCDDATA12 LCDDATA12
extern volatile uint16_t LCDDATA12 __attribute__((__sfr__));
typedef struct tagLCDDATA12BITS {
  uint16_t S00C3:1;
  uint16_t S01C3:1;
  uint16_t S02C3:1;
  uint16_t S03C3:1;
  uint16_t S04C3:1;
  uint16_t S05C3:1;
  uint16_t S06C3:1;
  uint16_t S07C3:1;
  uint16_t S08C3:1;
  uint16_t S09C3:1;
  uint16_t S10C3:1;
  uint16_t S11C3:1;
  uint16_t S12C3:1;
  uint16_t S13C3:1;
  uint16_t S14C3:1;
  uint16_t S15C3:1;
} LCDDATA12BITS;
extern volatile LCDDATA12BITS LCDDATA12bits __attribute__((__sfr__));

#define LCDDATA13 LCDDATA13
extern volatile uint16_t LCDDATA13 __attribute__((__sfr__));
typedef struct tagLCDDATA13BITS {
  uint16_t S16C3:1;
  uint16_t S17C3:1;
  uint16_t S18C3:1;
  uint16_t S19C3:1;
  uint16_t S20C3:1;
  uint16_t S21C3:1;
  uint16_t S22C3:1;
  uint16_t S23C3:1;
  uint16_t S24C3:1;
  uint16_t S25C3:1;
  uint16_t S26C3:1;
  uint16_t S27C3:1;
  uint16_t S28C3:1;
  uint16_t S29C3:1;
  uint16_t S30C3:1;
  uint16_t S31C3:1;
} LCDDATA13BITS;
extern volatile LCDDATA13BITS LCDDATA13bits __attribute__((__sfr__));

#define LCDDATA14 LCDDATA14
extern volatile uint16_t LCDDATA14 __attribute__((__sfr__));
typedef struct tagLCDDATA14BITS {
  uint16_t S32C3:1;
  uint16_t S33C3:1;
  uint16_t S34C3:1;
  uint16_t S35C3:1;
  uint16_t S36C3:1;
  uint16_t S37C3:1;
  uint16_t S38C3:1;
  uint16_t S39C3:1;
  uint16_t S40C3:1;
  uint16_t S41C3:1;
  uint16_t S42C3:1;
  uint16_t S43C3:1;
  uint16_t S44C3:1;
  uint16_t S45C3:1;
  uint16_t S46C3:1;
  uint16_t S47C3:1;
} LCDDATA14BITS;
extern volatile LCDDATA14BITS LCDDATA14bits __attribute__((__sfr__));

#define LCDDATA15 LCDDATA15
extern volatile uint16_t LCDDATA15 __attribute__((__sfr__));
typedef struct tagLCDDATA15BITS {
  uint16_t S48C3:1;
  uint16_t S49C3:1;
  uint16_t S50C3:1;
  uint16_t S51C3:1;
  uint16_t S52C3:1;
  uint16_t S53C3:1;
  uint16_t S54C3:1;
  uint16_t S55C3:1;
  uint16_t S56C3:1;
  uint16_t S57C3:1;
  uint16_t S58C3:1;
  uint16_t S59C3:1;
  uint16_t S60C3:1;
  uint16_t S61C3:1;
  uint16_t S62C3:1;
  uint16_t S63C3:1;
} LCDDATA15BITS;
extern volatile LCDDATA15BITS LCDDATA15bits __attribute__((__sfr__));

#define LCDDATA16 LCDDATA16
extern volatile uint16_t LCDDATA16 __attribute__((__sfr__));
typedef struct tagLCDDATA16BITS {
  uint16_t S00C4:1;
  uint16_t S01C4:1;
  uint16_t S02C4:1;
  uint16_t S03C4:1;
  uint16_t S04C4:1;
  uint16_t S05C4:1;
  uint16_t S06C4:1;
  uint16_t S07C4:1;
  uint16_t S08C4:1;
  uint16_t S09C4:1;
  uint16_t S10C4:1;
  uint16_t S11C4:1;
  uint16_t S12C4:1;
  uint16_t S13C4:1;
  uint16_t S14C4:1;
  uint16_t S15C4:1;
} LCDDATA16BITS;
