MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB406/mcu.h
extern volatile LCDDATA29BITS LCDDATA29bits __attribute__((__sfr__));

#define LCDDATA30 LCDDATA30
extern volatile uint16_t LCDDATA30 __attribute__((__sfr__));
typedef struct tagLCDDATA30BITS {
  uint16_t S32C7:1;
  uint16_t S33C7:1;
  uint16_t S34C7:1;
  uint16_t S35C7:1;
  uint16_t S36C7:1;
  uint16_t S37C7:1;
  uint16_t S38C7:1;
  uint16_t S39C7:1;
  uint16_t S40C7:1;
  uint16_t S41C7:1;
  uint16_t S42C7:1;
  uint16_t S43C7:1;
  uint16_t S44C7:1;
  uint16_t S45C7:1;
  uint16_t S46C7:1;
  uint16_t S47C7:1;
} LCDDATA30BITS;
extern volatile LCDDATA30BITS LCDDATA30bits __attribute__((__sfr__));

#define LCDDATA31 LCDDATA31
extern volatile uint16_t LCDDATA31 __attribute__((__sfr__));
typedef struct tagLCDDATA31BITS {
  uint16_t S48C7:1;
  uint16_t S49C7:1;
  uint16_t S50C7:1;
  uint16_t S51C7:1;
  uint16_t S52C7:1;
  uint16_t S53C7:1;
  uint16_t S54C7:1;
  uint16_t S55C7:1;
  uint16_t S56C7:1;
  uint16_t S57C7:1;
  uint16_t S58C7:1;
  uint16_t S59C7:1;
  uint16_t S60C7:1;
  uint16_t S61C7:1;
  uint16_t S62C7:1;
  uint16_t S63C7:1;
} LCDDATA31BITS;
extern volatile LCDDATA31BITS LCDDATA31bits __attribute__((__sfr__));

#define LCDSE0 LCDSE0
extern volatile uint16_t LCDSE0 __attribute__((__sfr__));
typedef struct tagLCDSE0BITS {
  uint16_t SE00:1;
  uint16_t SE01:1;
  uint16_t SE02:1;
  uint16_t SE03:1;
  uint16_t SE04:1;
  uint16_t SE05:1;
  uint16_t SE06:1;
  uint16_t SE07:1;
  uint16_t SE08:1;
  uint16_t SE09:1;
  uint16_t SE10:1;
  uint16_t SE11:1;
  uint16_t SE12:1;
  uint16_t SE13:1;
  uint16_t SE14:1;
  uint16_t SE15:1;
} LCDSE0BITS;
extern volatile LCDSE0BITS LCDSE0bits __attribute__((__sfr__));

#define LCDSE1 LCDSE1
extern volatile uint16_t LCDSE1 __attribute__((__sfr__));
typedef struct tagLCDSE1BITS {
  uint16_t SE16:1;
  uint16_t SE17:1;
  uint16_t SE18:1;
  uint16_t SE19:1;
  uint16_t SE20:1;
  uint16_t SE21:1;
  uint16_t SE22:1;
  uint16_t SE23:1;
  uint16_t SE24:1;
  uint16_t SE25:1;
  uint16_t SE26:1;
  uint16_t SE27:1;
  uint16_t SE28:1;
  uint16_t SE29:1;
  uint16_t SE30:1;
  uint16_t SE31:1;
} LCDSE1BITS;
extern volatile LCDSE1BITS LCDSE1bits __attribute__((__sfr__));

#define LCDSE2 LCDSE2
extern volatile uint16_t LCDSE2 __attribute__((__sfr__));
typedef struct tagLCDSE2BITS {
  uint16_t SE32:1;
  uint16_t SE33:1;
  uint16_t SE34:1;
  uint16_t SE35:1;
  uint16_t SE36:1;
  uint16_t SE37:1;
  uint16_t SE38:1;
  uint16_t SE39:1;
  uint16_t SE40:1;
  uint16_t SE41:1;
  uint16_t SE42:1;
  uint16_t SE43:1;
  uint16_t SE44:1;
  uint16_t SE45:1;
  uint16_t SE46:1;
  uint16_t SE47:1;
} LCDSE2BITS;
extern volatile LCDSE2BITS LCDSE2bits __attribute__((__sfr__));

#define LCDSE3 LCDSE3
extern volatile uint16_t LCDSE3 __attribute__((__sfr__));
typedef struct tagLCDSE3BITS {
  uint16_t SE48:1;
  uint16_t SE49:1;
  uint16_t SE50:1;
  uint16_t SE51:1;
  uint16_t SE52:1;
  uint16_t SE53:1;
  uint16_t SE54:1;
  uint16_t SE55:1;
  uint16_t SE56:1;
  uint16_t SE57:1;
  uint16_t SE58:1;
  uint16_t SE59:1;
  uint16_t SE60:1;
  uint16_t SE61:1;
  uint16_t SE62:1;
  uint16_t SE63:1;
} LCDSE3BITS;
extern volatile LCDSE3BITS LCDSE3bits __attribute__((__sfr__));

#define LCDREG LCDREG
extern volatile uint16_t LCDREG __attribute__((__sfr__));
typedef struct tagLCDREGBITS {
  uint16_t CLKSEL:2;
  uint16_t :13;
  uint16_t CPEN:1;
} LCDREGBITS;
extern volatile LCDREGBITS LCDREGbits __attribute__((__sfr__));

#define PADCON PADCON
extern volatile uint16_t PADCON __attribute__((__sfr__));
typedef struct tagPADCONBITS {
  uint16_t PMPTTL:1;
  uint16_t :14;
  uint16_t IOCON:1;
} PADCONBITS;
extern volatile PADCONBITS PADCONbits __attribute__((__sfr__));

#define IOCSTAT IOCSTAT
extern volatile uint16_t IOCSTAT __attribute__((__sfr__));
typedef struct tagIOCSTATBITS {
  uint16_t IOCPAF:1;
  uint16_t IOCPBF:1;
  uint16_t IOCPCF:1;
  uint16_t IOCPDF:1;
  uint16_t IOCPEF:1;
  uint16_t IOCPFF:1;
  uint16_t IOCPGF:1;
  uint16_t IOCPHF:1;
  uint16_t IOCPJF:1;
} IOCSTATBITS;
extern volatile IOCSTATBITS IOCSTATbits __attribute__((__sfr__));

#define TRISA TRISA
extern volatile uint16_t TRISA __attribute__((__sfr__));
typedef struct tagTRISABITS {
  uint16_t TRISA0:1;
  uint16_t TRISA1:1;
  uint16_t TRISA2:1;
  uint16_t TRISA3:1;
  uint16_t TRISA4:1;
  uint16_t TRISA5:1;
  uint16_t TRISA6:1;
  uint16_t TRISA7:1;
  uint16_t :1;
  uint16_t TRISA9:1;
  uint16_t TRISA10:1;
  uint16_t :3;
  uint16_t TRISA14:1;
  uint16_t TRISA15:1;
} TRISABITS;
extern volatile TRISABITS TRISAbits __attribute__((__sfr__));

#define PORTA PORTA
extern volatile uint16_t PORTA __attribute__((__sfr__));
typedef struct tagPORTABITS {
  uint16_t RA0:1;
  uint16_t RA1:1;
  uint16_t RA2:1;
  uint16_t RA3:1;
  uint16_t RA4:1;
  uint16_t RA5:1;
  uint16_t RA6:1;
  uint16_t RA7:1;
  uint16_t :1;
  uint16_t RA9:1;
  uint16_t RA10:1;
  uint16_t :3;
  uint16_t RA14:1;
  uint16_t RA15:1;
} PORTABITS;
extern volatile PORTABITS PORTAbits __attribute__((__sfr__));

#define LATA LATA
extern volatile uint16_t LATA __attribute__((__sfr__));
typedef struct tagLATABITS {
  uint16_t LATA0:1;
  uint16_t LATA1:1;
  uint16_t LATA2:1;
  uint16_t LATA3:1;
  uint16_t LATA4:1;
  uint16_t LATA5:1;
  uint16_t LATA6:1;
  uint16_t LATA7:1;
  uint16_t :1;
  uint16_t LATA9:1;
  uint16_t LATA10:1;
  uint16_t :3;
  uint16_t LATA14:1;
  uint16_t LATA15:1;
} LATABITS;
extern volatile LATABITS LATAbits __attribute__((__sfr__));

#define ODCA ODCA
extern volatile uint16_t ODCA __attribute__((__sfr__));
typedef struct tagODCABITS {
  uint16_t ODCA0:1;
  uint16_t ODCA1:1;
  uint16_t ODCA2:1;
  uint16_t ODCA3:1;
  uint16_t ODCA4:1;
  uint16_t ODCA5:1;
  uint16_t ODCA6:1;
  uint16_t ODCA7:1;
  uint16_t :1;
  uint16_t ODCA9:1;
  uint16_t ODCA10:1;
  uint16_t :3;
  uint16_t ODCA14:1;
  uint16_t ODCA15:1;
} ODCABITS;
extern volatile ODCABITS ODCAbits __attribute__((__sfr__));

#define ANSA ANSA
extern volatile uint16_t ANSA __attribute__((__sfr__));
__extension__ typedef struct tagANSABITS {
  union {
    struct {
      uint16_t ANSA0:1;
      uint16_t :1;
      uint16_t ANSA2:1;
      uint16_t ANSA3:1;
      uint16_t :1;
      uint16_t ANSA5:1;
      uint16_t ANSA6:1;
      uint16_t ANSA7:1;
      uint16_t :1;
      uint16_t ANSA9:1;
      uint16_t ANSA10:1;
      uint16_t :3;
      uint16_t ANSA14:1;
      uint16_t ANSA15:1;
    };
    struct {
      uint16_t ANSELA0:1;
      uint16_t :1;
      uint16_t ANSELA2:1;
      uint16_t ANSELA3:1;
      uint16_t :1;
      uint16_t ANSELA5:1;
      uint16_t ANSELA6:1;
      uint16_t ANSELA7:1;
      uint16_t :1;
      uint16_t ANSELA9:1;
      uint16_t ANSELA10:1;
      uint16_t :3;
      uint16_t ANSELA14:1;
      uint16_t ANSELA15:1;
    };
  };
} ANSABITS;
