MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB406/mcu.h
extern volatile ANSFBITS ANSFbits __attribute__((__sfr__));

#define IOCPF IOCPF
extern volatile uint16_t IOCPF __attribute__((__sfr__));
typedef struct tagIOCPFBITS {
  uint16_t IOCPF0:1;
  uint16_t IOCPF1:1;
  uint16_t IOCPF2:1;
  uint16_t IOCPF3:1;
  uint16_t IOCPF4:1;
  uint16_t IOCPF5:1;
  uint16_t IOCPF6:1;
  uint16_t IOCPF7:1;
  uint16_t IOCPF8:1;
  uint16_t :3;
  uint16_t IOCPF12:1;
  uint16_t IOCPF13:1;
} IOCPFBITS;
extern volatile IOCPFBITS IOCPFbits __attribute__((__sfr__));

#define IOCNF IOCNF
extern volatile uint16_t IOCNF __attribute__((__sfr__));
typedef struct tagIOCNFBITS {
  uint16_t IOCNF0:1;
  uint16_t IOCNF1:1;
  uint16_t IOCNF2:1;
  uint16_t IOCNF3:1;
  uint16_t IOCNF4:1;
  uint16_t IOCNF5:1;
  uint16_t IOCNF6:1;
  uint16_t IOCNF7:1;
  uint16_t IOCNF8:1;
  uint16_t :3;
  uint16_t IOCNF12:1;
  uint16_t IOCNF13:1;
} IOCNFBITS;
extern volatile IOCNFBITS IOCNFbits __attribute__((__sfr__));

#define IOCFF IOCFF
extern volatile uint16_t IOCFF __attribute__((__sfr__));
typedef struct tagIOCFFBITS {
  uint16_t IOCFF0:1;
  uint16_t IOCFF1:1;
  uint16_t IOCFF2:1;
  uint16_t IOCFF3:1;
  uint16_t IOCFF4:1;
  uint16_t IOCFF5:1;
  uint16_t IOCFF6:1;
  uint16_t IOCFF7:1;
  uint16_t IOCFF8:1;
  uint16_t :3;
  uint16_t IOCFF12:1;
  uint16_t IOCFF13:1;
} IOCFFBITS;
extern volatile IOCFFBITS IOCFFbits __attribute__((__sfr__));

#define CNPUF CNPUF
extern volatile uint16_t CNPUF __attribute__((__sfr__));
__extension__ typedef struct tagCNPUFBITS {
  union {
    struct {
      uint16_t IOCPF0:1;
      uint16_t IOCPF1:1;
      uint16_t IOCPF2:1;
      uint16_t IOCPF3:1;
      uint16_t IOCPF4:1;
      uint16_t IOCPF5:1;
      uint16_t IOCPF6:1;
      uint16_t IOCPF7:1;
      uint16_t IOCPF8:1;
      uint16_t :3;
      uint16_t IOCPF12:1;
      uint16_t IOCPF13:1;
    };
    struct {
      uint16_t IOCPUF0:1;
      uint16_t IOCPUF1:1;
      uint16_t IOCPUF2:1;
      uint16_t IOCPUF3:1;
      uint16_t IOCPUF4:1;
      uint16_t IOCPUF5:1;
      uint16_t IOCPUF6:1;
      uint16_t IOCPUF7:1;
      uint16_t IOCPUF8:1;
      uint16_t :3;
      uint16_t IOCPUF12:1;
      uint16_t IOCPUF13:1;
    };
    struct {
      uint16_t CNPUF0:1;
      uint16_t CNPUF1:1;
      uint16_t CNPUF2:1;
      uint16_t CNPUF3:1;
      uint16_t CNPUF4:1;
      uint16_t CNPUF5:1;
      uint16_t CNPUF6:1;
      uint16_t CNPUF7:1;
      uint16_t CNPUF8:1;
      uint16_t :3;
      uint16_t CNPUF12:1;
      uint16_t CNPUF13:1;
    };
  };
} CNPUFBITS;
extern volatile CNPUFBITS CNPUFbits __attribute__((__sfr__));

#define IOCPUF IOCPUF
extern volatile uint16_t IOCPUF __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUFBITS {
  union {
    struct {
      uint16_t IOCPF0:1;
      uint16_t IOCPF1:1;
      uint16_t IOCPF2:1;
      uint16_t IOCPF3:1;
      uint16_t IOCPF4:1;
      uint16_t IOCPF5:1;
      uint16_t IOCPF6:1;
      uint16_t IOCPF7:1;
      uint16_t IOCPF8:1;
      uint16_t :3;
      uint16_t IOCPF12:1;
      uint16_t IOCPF13:1;
    };
    struct {
      uint16_t IOCPUF0:1;
      uint16_t IOCPUF1:1;
      uint16_t IOCPUF2:1;
      uint16_t IOCPUF3:1;
      uint16_t IOCPUF4:1;
      uint16_t IOCPUF5:1;
      uint16_t IOCPUF6:1;
      uint16_t IOCPUF7:1;
      uint16_t IOCPUF8:1;
      uint16_t :3;
      uint16_t IOCPUF12:1;
      uint16_t IOCPUF13:1;
    };
    struct {
      uint16_t CNPUF0:1;
      uint16_t CNPUF1:1;
      uint16_t CNPUF2:1;
      uint16_t CNPUF3:1;
      uint16_t CNPUF4:1;
      uint16_t CNPUF5:1;
      uint16_t CNPUF6:1;
      uint16_t CNPUF7:1;
      uint16_t CNPUF8:1;
      uint16_t :3;
      uint16_t CNPUF12:1;
      uint16_t CNPUF13:1;
    };
  };
} IOCPUFBITS;
extern volatile IOCPUFBITS IOCPUFbits __attribute__((__sfr__));

#define CNPDF CNPDF
extern volatile uint16_t CNPDF __attribute__((__sfr__));
__extension__ typedef struct tagCNPDFBITS {
  union {
    struct {
      uint16_t IOCPDF0:1;
      uint16_t IOCPDF1:1;
      uint16_t IOCPDF2:1;
      uint16_t IOCPDF3:1;
      uint16_t IOCPDF4:1;
      uint16_t IOCPDF5:1;
      uint16_t IOCPDF6:1;
      uint16_t IOCPDF7:1;
      uint16_t IOCPDF8:1;
      uint16_t :3;
      uint16_t IOCPDF12:1;
      uint16_t IOCPDF13:1;
    };
    struct {
      uint16_t CNPDF0:1;
      uint16_t CNPDF1:1;
      uint16_t CNPDF2:1;
      uint16_t CNPDF3:1;
      uint16_t CNPDF4:1;
      uint16_t CNPDF5:1;
      uint16_t CNPDF6:1;
      uint16_t CNPDF7:1;
      uint16_t CNPDF8:1;
      uint16_t :3;
      uint16_t CNPDF12:1;
      uint16_t CNPDF13:1;
    };
  };
} CNPDFBITS;
extern volatile CNPDFBITS CNPDFbits __attribute__((__sfr__));

#define IOCPDF IOCPDF
extern volatile uint16_t IOCPDF __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDFBITS {
  union {
    struct {
      uint16_t IOCPDF0:1;
      uint16_t IOCPDF1:1;
      uint16_t IOCPDF2:1;
      uint16_t IOCPDF3:1;
      uint16_t IOCPDF4:1;
      uint16_t IOCPDF5:1;
      uint16_t IOCPDF6:1;
      uint16_t IOCPDF7:1;
      uint16_t IOCPDF8:1;
      uint16_t :3;
      uint16_t IOCPDF12:1;
      uint16_t IOCPDF13:1;
    };
    struct {
      uint16_t CNPDF0:1;
      uint16_t CNPDF1:1;
      uint16_t CNPDF2:1;
      uint16_t CNPDF3:1;
      uint16_t CNPDF4:1;
      uint16_t CNPDF5:1;
      uint16_t CNPDF6:1;
      uint16_t CNPDF7:1;
      uint16_t CNPDF8:1;
      uint16_t :3;
      uint16_t CNPDF12:1;
      uint16_t CNPDF13:1;
    };
  };
} IOCPDFBITS;
extern volatile IOCPDFBITS IOCPDFbits __attribute__((__sfr__));

#define TRISG TRISG
extern volatile uint16_t TRISG __attribute__((__sfr__));
typedef struct tagTRISGBITS {
  uint16_t TRISG0:1;
  uint16_t TRISG1:1;
  uint16_t TRISG2:1;
  uint16_t TRISG3:1;
  uint16_t :2;
  uint16_t TRISG6:1;
  uint16_t TRISG7:1;
  uint16_t TRISG8:1;
  uint16_t TRISG9:1;
  uint16_t :2;
  uint16_t TRISG12:1;
  uint16_t TRISG13:1;
  uint16_t TRISG14:1;
  uint16_t TRISG15:1;
} TRISGBITS;
extern volatile TRISGBITS TRISGbits __attribute__((__sfr__));

#define PORTG PORTG
extern volatile uint16_t PORTG __attribute__((__sfr__));
typedef struct tagPORTGBITS {
  uint16_t RG0:1;
  uint16_t RG1:1;
  uint16_t RG2:1;
  uint16_t RG3:1;
  uint16_t :2;
  uint16_t RG6:1;
  uint16_t RG7:1;
  uint16_t RG8:1;
  uint16_t RG9:1;
  uint16_t :2;
  uint16_t RG12:1;
  uint16_t RG13:1;
  uint16_t RG14:1;
  uint16_t RG15:1;
} PORTGBITS;
extern volatile PORTGBITS PORTGbits __attribute__((__sfr__));

#define LATG LATG
extern volatile uint16_t LATG __attribute__((__sfr__));
typedef struct tagLATGBITS {
  uint16_t LATG0:1;
  uint16_t LATG1:1;
  uint16_t LATG2:1;
  uint16_t LATG3:1;
  uint16_t :2;
  uint16_t LATG6:1;
  uint16_t LATG7:1;
  uint16_t LATG8:1;
  uint16_t LATG9:1;
  uint16_t :2;
  uint16_t LATG12:1;
  uint16_t LATG13:1;
  uint16_t LATG14:1;
  uint16_t LATG15:1;
} LATGBITS;
extern volatile LATGBITS LATGbits __attribute__((__sfr__));

#define ODCG ODCG
extern volatile uint16_t ODCG __attribute__((__sfr__));
typedef struct tagODCGBITS {
  uint16_t ODCG0:1;
  uint16_t ODCG1:1;
  uint16_t ODCG2:1;
  uint16_t ODCG3:1;
  uint16_t :2;
  uint16_t ODCG6:1;
  uint16_t ODCG7:1;
  uint16_t ODCG8:1;
  uint16_t ODCG9:1;
  uint16_t :2;
  uint16_t ODCG12:1;
  uint16_t ODCG13:1;
  uint16_t ODCG14:1;
  uint16_t ODCG15:1;
} ODCGBITS;
extern volatile ODCGBITS ODCGbits __attribute__((__sfr__));

#define ANSELG ANSELG
extern volatile uint16_t ANSELG __attribute__((__sfr__));
__extension__ typedef struct tagANSELGBITS {
  union {
    struct {
      uint16_t ANSG0:1;
      uint16_t ANSG1:1;
      uint16_t :4;
      uint16_t ANSG6:1;
      uint16_t ANSG7:1;
      uint16_t ANSG8:1;
      uint16_t ANSG9:1;
      uint16_t :2;
      uint16_t ANSG12:1;
      uint16_t ANSG13:1;
      uint16_t ANSG14:1;
      uint16_t ANSG15:1;
    };
    struct {
      uint16_t ANSELG0:1;
      uint16_t ANSELG1:1;
      uint16_t :4;
      uint16_t ANSELG6:1;
      uint16_t ANSELG7:1;
      uint16_t ANSELG8:1;
      uint16_t ANSELG9:1;
      uint16_t :2;
      uint16_t ANSELG12:1;
      uint16_t ANSELG13:1;
      uint16_t ANSELG14:1;
      uint16_t ANSELG15:1;
    };
  };
} ANSELGBITS;
extern volatile ANSELGBITS ANSELGbits __attribute__((__sfr__));

#define ANSG ANSG
extern volatile uint16_t ANSG __attribute__((__sfr__));
__extension__ typedef struct tagANSGBITS {
  union {
    struct {
      uint16_t ANSG0:1;
      uint16_t ANSG1:1;
      uint16_t :4;
      uint16_t ANSG6:1;
      uint16_t ANSG7:1;
      uint16_t ANSG8:1;
      uint16_t ANSG9:1;
      uint16_t :2;
      uint16_t ANSG12:1;
      uint16_t ANSG13:1;
      uint16_t ANSG14:1;
      uint16_t ANSG15:1;
    };
    struct {
      uint16_t ANSELG0:1;
      uint16_t ANSELG1:1;
      uint16_t :4;
      uint16_t ANSELG6:1;
      uint16_t ANSELG7:1;
      uint16_t ANSELG8:1;
      uint16_t ANSELG9:1;
      uint16_t :2;
      uint16_t ANSELG12:1;
      uint16_t ANSELG13:1;
      uint16_t ANSELG14:1;
      uint16_t ANSELG15:1;
    };
  };
} ANSGBITS;
extern volatile ANSGBITS ANSGbits __attribute__((__sfr__));

#define IOCPG IOCPG
extern volatile uint16_t IOCPG __attribute__((__sfr__));
typedef struct tagIOCPGBITS {
  uint16_t IOCPG0:1;
  uint16_t IOCPG1:1;
  uint16_t IOCPG2:1;
  uint16_t IOCPG3:1;
  uint16_t :2;
  uint16_t IOCPG6:1;
  uint16_t IOCPG7:1;
  uint16_t IOCPG8:1;
  uint16_t IOCPG9:1;
  uint16_t :2;
  uint16_t IOCPG12:1;
  uint16_t IOCPG13:1;
  uint16_t IOCPG14:1;
  uint16_t IOCPG15:1;
} IOCPGBITS;
