MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB406/mcu.h
#define _IPC7_INT2IP0_POSITION                   0x00000004
#define _IPC7_INT2IP0_MASK                       0x00000010
#define _IPC7_INT2IP0_LENGTH                     0x00000001

#define _IPC7_INT2IP1_POSITION                   0x00000005
#define _IPC7_INT2IP1_MASK                       0x00000020
#define _IPC7_INT2IP1_LENGTH                     0x00000001

#define _IPC7_INT2IP2_POSITION                   0x00000006
#define _IPC7_INT2IP2_MASK                       0x00000040
#define _IPC7_INT2IP2_LENGTH                     0x00000001

#define _IPC7_U2RXIP0_POSITION                   0x00000008
#define _IPC7_U2RXIP0_MASK                       0x00000100
#define _IPC7_U2RXIP0_LENGTH                     0x00000001

#define _IPC7_U2RXIP1_POSITION                   0x00000009
#define _IPC7_U2RXIP1_MASK                       0x00000200
#define _IPC7_U2RXIP1_LENGTH                     0x00000001

#define _IPC7_U2RXIP2_POSITION                   0x0000000A
#define _IPC7_U2RXIP2_MASK                       0x00000400
#define _IPC7_U2RXIP2_LENGTH                     0x00000001

#define _IPC7_U2TXIP0_POSITION                   0x0000000C
#define _IPC7_U2TXIP0_MASK                       0x00001000
#define _IPC7_U2TXIP0_LENGTH                     0x00000001

#define _IPC7_U2TXIP1_POSITION                   0x0000000D
#define _IPC7_U2TXIP1_MASK                       0x00002000
#define _IPC7_U2TXIP1_LENGTH                     0x00000001

#define _IPC7_U2TXIP2_POSITION                   0x0000000E
#define _IPC7_U2TXIP2_MASK                       0x00004000
#define _IPC7_U2TXIP2_LENGTH                     0x00000001

#define _IPC8_SPI2IP_POSITION                    0x00000000
#define _IPC8_SPI2IP_MASK                        0x00000007
#define _IPC8_SPI2IP_LENGTH                      0x00000003

#define _IPC8_SPI2TXIP_POSITION                  0x00000004
#define _IPC8_SPI2TXIP_MASK                      0x00000070
#define _IPC8_SPI2TXIP_LENGTH                    0x00000003

#define _IPC8_CRYFREEIP_POSITION                 0x00000008
#define _IPC8_CRYFREEIP_MASK                     0x00000700
#define _IPC8_CRYFREEIP_LENGTH                   0x00000003

#define _IPC8_CRYROLLIP_POSITION                 0x0000000C
#define _IPC8_CRYROLLIP_MASK                     0x00007000
#define _IPC8_CRYROLLIP_LENGTH                   0x00000003

#define _IPC8_SPI2IP0_POSITION                   0x00000000
#define _IPC8_SPI2IP0_MASK                       0x00000001
#define _IPC8_SPI2IP0_LENGTH                     0x00000001

#define _IPC8_SPI2IP1_POSITION                   0x00000001
#define _IPC8_SPI2IP1_MASK                       0x00000002
#define _IPC8_SPI2IP1_LENGTH                     0x00000001

#define _IPC8_SPI2IP2_POSITION                   0x00000002
#define _IPC8_SPI2IP2_MASK                       0x00000004
#define _IPC8_SPI2IP2_LENGTH                     0x00000001

#define _IPC8_SPI2TXIP0_POSITION                 0x00000004
#define _IPC8_SPI2TXIP0_MASK                     0x00000010
#define _IPC8_SPI2TXIP0_LENGTH                   0x00000001

#define _IPC8_SPI2TXIP1_POSITION                 0x00000005
#define _IPC8_SPI2TXIP1_MASK                     0x00000020
#define _IPC8_SPI2TXIP1_LENGTH                   0x00000001

#define _IPC8_SPI2TXIP2_POSITION                 0x00000006
#define _IPC8_SPI2TXIP2_MASK                     0x00000040
#define _IPC8_SPI2TXIP2_LENGTH                   0x00000001

#define _IPC8_CRYFREEIP0_POSITION                0x00000008
#define _IPC8_CRYFREEIP0_MASK                    0x00000100
#define _IPC8_CRYFREEIP0_LENGTH                  0x00000001

#define _IPC8_CRYFREEIP1_POSITION                0x00000009
#define _IPC8_CRYFREEIP1_MASK                    0x00000200
#define _IPC8_CRYFREEIP1_LENGTH                  0x00000001

#define _IPC8_CRYFREEIP2_POSITION                0x0000000A
#define _IPC8_CRYFREEIP2_MASK                    0x00000400
#define _IPC8_CRYFREEIP2_LENGTH                  0x00000001

#define _IPC8_CRYROLLIP0_POSITION                0x0000000C
#define _IPC8_CRYROLLIP0_MASK                    0x00001000
#define _IPC8_CRYROLLIP0_LENGTH                  0x00000001

#define _IPC8_CRYROLLIP1_POSITION                0x0000000D
#define _IPC8_CRYROLLIP1_MASK                    0x00002000
#define _IPC8_CRYROLLIP1_LENGTH                  0x00000001

#define _IPC8_CRYROLLIP2_POSITION                0x0000000E
#define _IPC8_CRYROLLIP2_MASK                    0x00004000
#define _IPC8_CRYROLLIP2_LENGTH                  0x00000001

#define _IPC9_DMA3IP_POSITION                    0x00000000
#define _IPC9_DMA3IP_MASK                        0x00000007
#define _IPC9_DMA3IP_LENGTH                      0x00000003

#define _IPC9_IC3IP_POSITION                     0x00000004
#define _IPC9_IC3IP_MASK                         0x00000070
#define _IPC9_IC3IP_LENGTH                       0x00000003

#define _IPC9_IC4IP_POSITION                     0x00000008
#define _IPC9_IC4IP_MASK                         0x00000700
#define _IPC9_IC4IP_LENGTH                       0x00000003

#define _IPC9_IC5IP_POSITION                     0x0000000C
#define _IPC9_IC5IP_MASK                         0x00007000
#define _IPC9_IC5IP_LENGTH                       0x00000003

#define _IPC9_DMA3IP0_POSITION                   0x00000000
#define _IPC9_DMA3IP0_MASK                       0x00000001
#define _IPC9_DMA3IP0_LENGTH                     0x00000001

#define _IPC9_DMA3IP1_POSITION                   0x00000001
#define _IPC9_DMA3IP1_MASK                       0x00000002
#define _IPC9_DMA3IP1_LENGTH                     0x00000001

#define _IPC9_DMA3IP2_POSITION                   0x00000002
#define _IPC9_DMA3IP2_MASK                       0x00000004
#define _IPC9_DMA3IP2_LENGTH                     0x00000001

#define _IPC9_IC3IP0_POSITION                    0x00000004
#define _IPC9_IC3IP0_MASK                        0x00000010
#define _IPC9_IC3IP0_LENGTH                      0x00000001

#define _IPC9_IC3IP1_POSITION                    0x00000005
#define _IPC9_IC3IP1_MASK                        0x00000020
#define _IPC9_IC3IP1_LENGTH                      0x00000001

