MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB406/mcu.h
#define _IPC12_CCT6IP_POSITION                   0x00000000
#define _IPC12_CCT6IP_MASK                       0x00000007
#define _IPC12_CCT6IP_LENGTH                     0x00000003

#define _IPC12_SI2C2IP_POSITION                  0x00000004
#define _IPC12_SI2C2IP_MASK                      0x00000070
#define _IPC12_SI2C2IP_LENGTH                    0x00000003

#define _IPC12_MI2C2IP_POSITION                  0x00000008
#define _IPC12_MI2C2IP_MASK                      0x00000700
#define _IPC12_MI2C2IP_LENGTH                    0x00000003

#define _IPC12_CCT7IP_POSITION                   0x0000000C
#define _IPC12_CCT7IP_MASK                       0x00007000
#define _IPC12_CCT7IP_LENGTH                     0x00000003

#define _IPC12_CCT6IP0_POSITION                  0x00000000
#define _IPC12_CCT6IP0_MASK                      0x00000001
#define _IPC12_CCT6IP0_LENGTH                    0x00000001

#define _IPC12_CCT6IP1_POSITION                  0x00000001
#define _IPC12_CCT6IP1_MASK                      0x00000002
#define _IPC12_CCT6IP1_LENGTH                    0x00000001

#define _IPC12_CCT6IP2_POSITION                  0x00000002
#define _IPC12_CCT6IP2_MASK                      0x00000004
#define _IPC12_CCT6IP2_LENGTH                    0x00000001

#define _IPC12_SI2C2IP0_POSITION                 0x00000004
#define _IPC12_SI2C2IP0_MASK                     0x00000010
#define _IPC12_SI2C2IP0_LENGTH                   0x00000001

#define _IPC12_SI2C2IP1_POSITION                 0x00000005
#define _IPC12_SI2C2IP1_MASK                     0x00000020
#define _IPC12_SI2C2IP1_LENGTH                   0x00000001

#define _IPC12_SI2C2IP2_POSITION                 0x00000006
#define _IPC12_SI2C2IP2_MASK                     0x00000040
#define _IPC12_SI2C2IP2_LENGTH                   0x00000001

#define _IPC12_MI2C2IP0_POSITION                 0x00000008
#define _IPC12_MI2C2IP0_MASK                     0x00000100
#define _IPC12_MI2C2IP0_LENGTH                   0x00000001

#define _IPC12_MI2C2IP1_POSITION                 0x00000009
#define _IPC12_MI2C2IP1_MASK                     0x00000200
#define _IPC12_MI2C2IP1_LENGTH                   0x00000001

#define _IPC12_MI2C2IP2_POSITION                 0x0000000A
#define _IPC12_MI2C2IP2_MASK                     0x00000400
#define _IPC12_MI2C2IP2_LENGTH                   0x00000001

#define _IPC12_CCT7IP0_POSITION                  0x0000000C
#define _IPC12_CCT7IP0_MASK                      0x00001000
#define _IPC12_CCT7IP0_LENGTH                    0x00000001

#define _IPC12_CCT7IP1_POSITION                  0x0000000D
#define _IPC12_CCT7IP1_MASK                      0x00002000
#define _IPC12_CCT7IP1_LENGTH                    0x00000001

#define _IPC12_CCT7IP2_POSITION                  0x0000000E
#define _IPC12_CCT7IP2_MASK                      0x00004000
#define _IPC12_CCT7IP2_LENGTH                    0x00000001

#define _IPC13_INT3IP_POSITION                   0x00000004
#define _IPC13_INT3IP_MASK                       0x00000070
#define _IPC13_INT3IP_LENGTH                     0x00000003

#define _IPC13_INT4IP_POSITION                   0x00000008
#define _IPC13_INT4IP_MASK                       0x00000700
#define _IPC13_INT4IP_LENGTH                     0x00000003

#define _IPC13_CRYDNIP_POSITION                  0x0000000C
#define _IPC13_CRYDNIP_MASK                      0x00007000
#define _IPC13_CRYDNIP_LENGTH                    0x00000003

#define _IPC13_INT3IP0_POSITION                  0x00000004
#define _IPC13_INT3IP0_MASK                      0x00000010
#define _IPC13_INT3IP0_LENGTH                    0x00000001

#define _IPC13_INT3IP1_POSITION                  0x00000005
#define _IPC13_INT3IP1_MASK                      0x00000020
#define _IPC13_INT3IP1_LENGTH                    0x00000001

#define _IPC13_INT3IP2_POSITION                  0x00000006
#define _IPC13_INT3IP2_MASK                      0x00000040
#define _IPC13_INT3IP2_LENGTH                    0x00000001

#define _IPC13_INT4IP0_POSITION                  0x00000008
#define _IPC13_INT4IP0_MASK                      0x00000100
#define _IPC13_INT4IP0_LENGTH                    0x00000001

#define _IPC13_INT4IP1_POSITION                  0x00000009
#define _IPC13_INT4IP1_MASK                      0x00000200
#define _IPC13_INT4IP1_LENGTH                    0x00000001

#define _IPC13_INT4IP2_POSITION                  0x0000000A
#define _IPC13_INT4IP2_MASK                      0x00000400
#define _IPC13_INT4IP2_LENGTH                    0x00000001

#define _IPC13_CRYDNIP0_POSITION                 0x0000000C
#define _IPC13_CRYDNIP0_MASK                     0x00001000
#define _IPC13_CRYDNIP0_LENGTH                   0x00000001

#define _IPC13_CRYDNIP1_POSITION                 0x0000000D
#define _IPC13_CRYDNIP1_MASK                     0x00002000
#define _IPC13_CRYDNIP1_LENGTH                   0x00000001

#define _IPC13_CRYDNIP2_POSITION                 0x0000000E
#define _IPC13_CRYDNIP2_MASK                     0x00004000
#define _IPC13_CRYDNIP2_LENGTH                   0x00000001

#define _IPC14_KEYSTRIP_POSITION                 0x00000000
#define _IPC14_KEYSTRIP_MASK                     0x00000007
#define _IPC14_KEYSTRIP_LENGTH                   0x00000003

#define _IPC14_SPI4RXIP_POSITION                 0x00000004
#define _IPC14_SPI4RXIP_MASK                     0x00000070
#define _IPC14_SPI4RXIP_LENGTH                   0x00000003

#define _IPC14_SPI1RXIP_POSITION                 0x00000008
#define _IPC14_SPI1RXIP_MASK                     0x00000700
#define _IPC14_SPI1RXIP_LENGTH                   0x00000003

#define _IPC14_SPI2RXIP_POSITION                 0x0000000C
#define _IPC14_SPI2RXIP_MASK                     0x00007000
#define _IPC14_SPI2RXIP_LENGTH                   0x00000003

#define _IPC14_KEYSTRIP0_POSITION                0x00000000
#define _IPC14_KEYSTRIP0_MASK                    0x00000001
#define _IPC14_KEYSTRIP0_LENGTH                  0x00000001

#define _IPC14_KEYSTRIP1_POSITION                0x00000001
#define _IPC14_KEYSTRIP1_MASK                    0x00000002
#define _IPC14_KEYSTRIP1_LENGTH                  0x00000001

#define _IPC14_KEYSTRIP2_POSITION                0x00000002
#define _IPC14_KEYSTRIP2_MASK                    0x00000004
#define _IPC14_KEYSTRIP2_LENGTH                  0x00000001

#define _IPC14_SPI4RXIP0_POSITION                0x00000004
#define _IPC14_SPI4RXIP0_MASK                    0x00000010
#define _IPC14_SPI4RXIP0_LENGTH                  0x00000001

