MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB406/mcu.h
#define _CCP2STATL_TRSET_POSITION                0x00000006
#define _CCP2STATL_TRSET_MASK                    0x00000040
#define _CCP2STATL_TRSET_LENGTH                  0x00000001

#define _CCP2STATL_CCPTRIG_POSITION              0x00000007
#define _CCP2STATL_CCPTRIG_MASK                  0x00000080
#define _CCP2STATL_CCPTRIG_LENGTH                0x00000001

#define _CCP2STATL_ICGARM_POSITION               0x0000000A
#define _CCP2STATL_ICGARM_MASK                   0x00000400
#define _CCP2STATL_ICGARM_LENGTH                 0x00000001

#define _CCP2STATL_TRIG_POSITION                 0x00000007
#define _CCP2STATL_TRIG_MASK                     0x00000080
#define _CCP2STATL_TRIG_LENGTH                   0x00000001

#define _CCP2STATH_RAWIP_POSITION                0x00000000
#define _CCP2STATH_RAWIP_MASK                    0x00000001
#define _CCP2STATH_RAWIP_LENGTH                  0x00000001

#define _CCP2STATH_RBWIP_POSITION                0x00000001
#define _CCP2STATH_RBWIP_MASK                    0x00000002
#define _CCP2STATH_RBWIP_LENGTH                  0x00000001

#define _CCP2STATH_TMRLWIP_POSITION              0x00000002
#define _CCP2STATH_TMRLWIP_MASK                  0x00000004
#define _CCP2STATH_TMRLWIP_LENGTH                0x00000001

#define _CCP2STATH_TMRHWIP_POSITION              0x00000003
#define _CCP2STATH_TMRHWIP_MASK                  0x00000008
#define _CCP2STATH_TMRHWIP_LENGTH                0x00000001

#define _CCP2STATH_PRLWIP_POSITION               0x00000004
#define _CCP2STATH_PRLWIP_MASK                   0x00000010
#define _CCP2STATH_PRLWIP_LENGTH                 0x00000001

#define _CCP3CON1L_MOD_POSITION                  0x00000000
#define _CCP3CON1L_MOD_MASK                      0x0000000F
#define _CCP3CON1L_MOD_LENGTH                    0x00000004

#define _CCP3CON1L_CCSEL_POSITION                0x00000004
#define _CCP3CON1L_CCSEL_MASK                    0x00000010
#define _CCP3CON1L_CCSEL_LENGTH                  0x00000001

#define _CCP3CON1L_T32_POSITION                  0x00000005
#define _CCP3CON1L_T32_MASK                      0x00000020
#define _CCP3CON1L_T32_LENGTH                    0x00000001

#define _CCP3CON1L_TMRPS_POSITION                0x00000006
#define _CCP3CON1L_TMRPS_MASK                    0x000000C0
#define _CCP3CON1L_TMRPS_LENGTH                  0x00000002

#define _CCP3CON1L_CLKSEL_POSITION               0x00000008
#define _CCP3CON1L_CLKSEL_MASK                   0x00000700
#define _CCP3CON1L_CLKSEL_LENGTH                 0x00000003

#define _CCP3CON1L_TMRSYNC_POSITION              0x0000000B
#define _CCP3CON1L_TMRSYNC_MASK                  0x00000800
#define _CCP3CON1L_TMRSYNC_LENGTH                0x00000001

#define _CCP3CON1L_CCPSLP_POSITION               0x0000000C
#define _CCP3CON1L_CCPSLP_MASK                   0x00001000
#define _CCP3CON1L_CCPSLP_LENGTH                 0x00000001

#define _CCP3CON1L_CCPSIDL_POSITION              0x0000000D
#define _CCP3CON1L_CCPSIDL_MASK                  0x00002000
#define _CCP3CON1L_CCPSIDL_LENGTH                0x00000001

#define _CCP3CON1L_CCPON_POSITION                0x0000000F
#define _CCP3CON1L_CCPON_MASK                    0x00008000
#define _CCP3CON1L_CCPON_LENGTH                  0x00000001

#define _CCP3CON1L_MOD0_POSITION                 0x00000000
#define _CCP3CON1L_MOD0_MASK                     0x00000001
#define _CCP3CON1L_MOD0_LENGTH                   0x00000001

#define _CCP3CON1L_MOD1_POSITION                 0x00000001
#define _CCP3CON1L_MOD1_MASK                     0x00000002
#define _CCP3CON1L_MOD1_LENGTH                   0x00000001

#define _CCP3CON1L_MOD2_POSITION                 0x00000002
#define _CCP3CON1L_MOD2_MASK                     0x00000004
#define _CCP3CON1L_MOD2_LENGTH                   0x00000001

#define _CCP3CON1L_MOD3_POSITION                 0x00000003
#define _CCP3CON1L_MOD3_MASK                     0x00000008
#define _CCP3CON1L_MOD3_LENGTH                   0x00000001

#define _CCP3CON1L_TMR32_POSITION                0x00000005
#define _CCP3CON1L_TMR32_MASK                    0x00000020
#define _CCP3CON1L_TMR32_LENGTH                  0x00000001

#define _CCP3CON1L_TMRPS0_POSITION               0x00000006
#define _CCP3CON1L_TMRPS0_MASK                   0x00000040
#define _CCP3CON1L_TMRPS0_LENGTH                 0x00000001

#define _CCP3CON1L_TMRPS1_POSITION               0x00000007
#define _CCP3CON1L_TMRPS1_MASK                   0x00000080
#define _CCP3CON1L_TMRPS1_LENGTH                 0x00000001

#define _CCP3CON1L_CLKSEL0_POSITION              0x00000008
#define _CCP3CON1L_CLKSEL0_MASK                  0x00000100
#define _CCP3CON1L_CLKSEL0_LENGTH                0x00000001

#define _CCP3CON1L_CLKSEL1_POSITION              0x00000009
#define _CCP3CON1L_CLKSEL1_MASK                  0x00000200
#define _CCP3CON1L_CLKSEL1_LENGTH                0x00000001

#define _CCP3CON1L_CLKSEL2_POSITION              0x0000000A
#define _CCP3CON1L_CLKSEL2_MASK                  0x00000400
#define _CCP3CON1L_CLKSEL2_LENGTH                0x00000001

#define _CCP3CON1L_CCPMOD_POSITION               0x00000000
#define _CCP3CON1L_CCPMOD_MASK                   0x0000000F
#define _CCP3CON1L_CCPMOD_LENGTH                 0x00000004

#define _CCP3CON1L_CCPMOD0_POSITION              0x00000000
#define _CCP3CON1L_CCPMOD0_MASK                  0x00000001
#define _CCP3CON1L_CCPMOD0_LENGTH                0x00000001

#define _CCP3CON1L_CCPMOD1_POSITION              0x00000001
#define _CCP3CON1L_CCPMOD1_MASK                  0x00000002
#define _CCP3CON1L_CCPMOD1_LENGTH                0x00000001

#define _CCP3CON1L_CCPMOD2_POSITION              0x00000002
#define _CCP3CON1L_CCPMOD2_MASK                  0x00000004
#define _CCP3CON1L_CCPMOD2_LENGTH                0x00000001

#define _CCP3CON1L_CCPMOD3_POSITION              0x00000003
#define _CCP3CON1L_CCPMOD3_MASK                  0x00000008
#define _CCP3CON1L_CCPMOD3_LENGTH                0x00000001

#define _CCP3CON1H_SYNC_POSITION                 0x00000000
#define _CCP3CON1H_SYNC_MASK                     0x0000001F
#define _CCP3CON1H_SYNC_LENGTH                   0x00000005

#define _CCP3CON1H_ALTSYNC_POSITION              0x00000005
#define _CCP3CON1H_ALTSYNC_MASK                  0x00000020
#define _CCP3CON1H_ALTSYNC_LENGTH                0x00000001

#define _CCP3CON1H_ONESHOT_POSITION              0x00000006
#define _CCP3CON1H_ONESHOT_MASK                  0x00000040
#define _CCP3CON1H_ONESHOT_LENGTH                0x00000001

#define _CCP3CON1H_TRIGEN_POSITION               0x00000007
#define _CCP3CON1H_TRIGEN_MASK                   0x00000080
#define _CCP3CON1H_TRIGEN_LENGTH                 0x00000001

#define _CCP3CON1H_OPS_POSITION                  0x00000008
#define _CCP3CON1H_OPS_MASK                      0x00000F00
#define _CCP3CON1H_OPS_LENGTH                    0x00000004

#define _CCP3CON1H_RTRGEN_POSITION               0x0000000E
#define _CCP3CON1H_RTRGEN_MASK                   0x00004000
#define _CCP3CON1H_RTRGEN_LENGTH                 0x00000001

#define _CCP3CON1H_OPSSRC_POSITION               0x0000000F
#define _CCP3CON1H_OPSSRC_MASK                   0x00008000
#define _CCP3CON1H_OPSSRC_LENGTH                 0x00000001

#define _CCP3CON1H_SYNC0_POSITION                0x00000000
#define _CCP3CON1H_SYNC0_MASK                    0x00000001
#define _CCP3CON1H_SYNC0_LENGTH                  0x00000001

#define _CCP3CON1H_SYNC1_POSITION                0x00000001
#define _CCP3CON1H_SYNC1_MASK                    0x00000002
#define _CCP3CON1H_SYNC1_LENGTH                  0x00000001

#define _CCP3CON1H_SYNC2_POSITION                0x00000002
#define _CCP3CON1H_SYNC2_MASK                    0x00000004
#define _CCP3CON1H_SYNC2_LENGTH                  0x00000001

#define _CCP3CON1H_SYNC3_POSITION                0x00000003
#define _CCP3CON1H_SYNC3_MASK                    0x00000008
#define _CCP3CON1H_SYNC3_LENGTH                  0x00000001

#define _CCP3CON1H_SYNC4_POSITION                0x00000004
#define _CCP3CON1H_SYNC4_MASK                    0x00000010
#define _CCP3CON1H_SYNC4_LENGTH                  0x00000001

#define _CCP3CON1H_OPS0_POSITION                 0x00000008
#define _CCP3CON1H_OPS0_MASK                     0x00000100
#define _CCP3CON1H_OPS0_LENGTH                   0x00000001

#define _CCP3CON1H_OPS1_POSITION                 0x00000009
#define _CCP3CON1H_OPS1_MASK                     0x00000200
#define _CCP3CON1H_OPS1_LENGTH                   0x00000001

#define _CCP3CON1H_OPS2_POSITION                 0x0000000A
#define _CCP3CON1H_OPS2_MASK                     0x00000400
#define _CCP3CON1H_OPS2_LENGTH                   0x00000001

