MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB406/mcu.h
#define _CNPUC_IOCPC15_POSITION                  0x0000000F
#define _CNPUC_IOCPC15_MASK                      0x00008000
#define _CNPUC_IOCPC15_LENGTH                    0x00000001

#define _CNPUC_IOCPUC12_POSITION                 0x0000000C
#define _CNPUC_IOCPUC12_MASK                     0x00001000
#define _CNPUC_IOCPUC12_LENGTH                   0x00000001

#define _CNPUC_IOCPUC15_POSITION                 0x0000000F
#define _CNPUC_IOCPUC15_MASK                     0x00008000
#define _CNPUC_IOCPUC15_LENGTH                   0x00000001

#define _CNPUC_CNPUC12_POSITION                  0x0000000C
#define _CNPUC_CNPUC12_MASK                      0x00001000
#define _CNPUC_CNPUC12_LENGTH                    0x00000001

#define _CNPUC_CNPUC15_POSITION                  0x0000000F
#define _CNPUC_CNPUC15_MASK                      0x00008000
#define _CNPUC_CNPUC15_LENGTH                    0x00000001

#define _IOCPUC_IOCPC12_POSITION                 0x0000000C
#define _IOCPUC_IOCPC12_MASK                     0x00001000
#define _IOCPUC_IOCPC12_LENGTH                   0x00000001

#define _IOCPUC_IOCPC15_POSITION                 0x0000000F
#define _IOCPUC_IOCPC15_MASK                     0x00008000
#define _IOCPUC_IOCPC15_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC12_POSITION                0x0000000C
#define _IOCPUC_IOCPUC12_MASK                    0x00001000
#define _IOCPUC_IOCPUC12_LENGTH                  0x00000001

#define _IOCPUC_IOCPUC15_POSITION                0x0000000F
#define _IOCPUC_IOCPUC15_MASK                    0x00008000
#define _IOCPUC_IOCPUC15_LENGTH                  0x00000001

#define _IOCPUC_CNPUC12_POSITION                 0x0000000C
#define _IOCPUC_CNPUC12_MASK                     0x00001000
#define _IOCPUC_CNPUC12_LENGTH                   0x00000001

#define _IOCPUC_CNPUC15_POSITION                 0x0000000F
#define _IOCPUC_CNPUC15_MASK                     0x00008000
#define _IOCPUC_CNPUC15_LENGTH                   0x00000001

#define _CNPDC_IOCPDC12_POSITION                 0x0000000C
#define _CNPDC_IOCPDC12_MASK                     0x00001000
#define _CNPDC_IOCPDC12_LENGTH                   0x00000001

#define _CNPDC_IOCPDC15_POSITION                 0x0000000F
#define _CNPDC_IOCPDC15_MASK                     0x00008000
#define _CNPDC_IOCPDC15_LENGTH                   0x00000001

#define _CNPDC_CNPDC12_POSITION                  0x0000000C
#define _CNPDC_CNPDC12_MASK                      0x00001000
#define _CNPDC_CNPDC12_LENGTH                    0x00000001

#define _CNPDC_CNPDC15_POSITION                  0x0000000F
#define _CNPDC_CNPDC15_MASK                      0x00008000
#define _CNPDC_CNPDC15_LENGTH                    0x00000001

#define _IOCPDC_IOCPDC12_POSITION                0x0000000C
#define _IOCPDC_IOCPDC12_MASK                    0x00001000
#define _IOCPDC_IOCPDC12_LENGTH                  0x00000001

#define _IOCPDC_IOCPDC15_POSITION                0x0000000F
#define _IOCPDC_IOCPDC15_MASK                    0x00008000
#define _IOCPDC_IOCPDC15_LENGTH                  0x00000001

#define _IOCPDC_CNPDC12_POSITION                 0x0000000C
#define _IOCPDC_CNPDC12_MASK                     0x00001000
#define _IOCPDC_CNPDC12_LENGTH                   0x00000001

#define _IOCPDC_CNPDC15_POSITION                 0x0000000F
#define _IOCPDC_CNPDC15_MASK                     0x00008000
#define _IOCPDC_CNPDC15_LENGTH                   0x00000001

#define _TRISD_TRISD0_POSITION                   0x00000000
#define _TRISD_TRISD0_MASK                       0x00000001
#define _TRISD_TRISD0_LENGTH                     0x00000001

#define _TRISD_TRISD1_POSITION                   0x00000001
#define _TRISD_TRISD1_MASK                       0x00000002
#define _TRISD_TRISD1_LENGTH                     0x00000001

#define _TRISD_TRISD2_POSITION                   0x00000002
#define _TRISD_TRISD2_MASK                       0x00000004
#define _TRISD_TRISD2_LENGTH                     0x00000001

#define _TRISD_TRISD3_POSITION                   0x00000003
#define _TRISD_TRISD3_MASK                       0x00000008
#define _TRISD_TRISD3_LENGTH                     0x00000001

#define _TRISD_TRISD4_POSITION                   0x00000004
#define _TRISD_TRISD4_MASK                       0x00000010
#define _TRISD_TRISD4_LENGTH                     0x00000001

#define _TRISD_TRISD5_POSITION                   0x00000005
#define _TRISD_TRISD5_MASK                       0x00000020
#define _TRISD_TRISD5_LENGTH                     0x00000001

#define _TRISD_TRISD6_POSITION                   0x00000006
#define _TRISD_TRISD6_MASK                       0x00000040
#define _TRISD_TRISD6_LENGTH                     0x00000001

#define _TRISD_TRISD7_POSITION                   0x00000007
#define _TRISD_TRISD7_MASK                       0x00000080
#define _TRISD_TRISD7_LENGTH                     0x00000001

#define _TRISD_TRISD8_POSITION                   0x00000008
#define _TRISD_TRISD8_MASK                       0x00000100
#define _TRISD_TRISD8_LENGTH                     0x00000001

#define _TRISD_TRISD9_POSITION                   0x00000009
#define _TRISD_TRISD9_MASK                       0x00000200
#define _TRISD_TRISD9_LENGTH                     0x00000001

#define _TRISD_TRISD10_POSITION                  0x0000000A
#define _TRISD_TRISD10_MASK                      0x00000400
#define _TRISD_TRISD10_LENGTH                    0x00000001

#define _TRISD_TRISD11_POSITION                  0x0000000B
#define _TRISD_TRISD11_MASK                      0x00000800
#define _TRISD_TRISD11_LENGTH                    0x00000001

#define _PORTD_RD0_POSITION                      0x00000000
#define _PORTD_RD0_MASK                          0x00000001
#define _PORTD_RD0_LENGTH                        0x00000001

#define _PORTD_RD1_POSITION                      0x00000001
#define _PORTD_RD1_MASK                          0x00000002
#define _PORTD_RD1_LENGTH                        0x00000001

#define _PORTD_RD2_POSITION                      0x00000002
#define _PORTD_RD2_MASK                          0x00000004
#define _PORTD_RD2_LENGTH                        0x00000001

#define _PORTD_RD3_POSITION                      0x00000003
#define _PORTD_RD3_MASK                          0x00000008
#define _PORTD_RD3_LENGTH                        0x00000001

#define _PORTD_RD4_POSITION                      0x00000004
#define _PORTD_RD4_MASK                          0x00000010
#define _PORTD_RD4_LENGTH                        0x00000001

#define _PORTD_RD5_POSITION                      0x00000005
#define _PORTD_RD5_MASK                          0x00000020
#define _PORTD_RD5_LENGTH                        0x00000001

