MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB406/mcu.h
#define _LATF_LATF13_POSITION                    0x0000000D
#define _LATF_LATF13_MASK                        0x00002000
#define _LATF_LATF13_LENGTH                      0x00000001

#define _ODCF_ODCF0_POSITION                     0x00000000
#define _ODCF_ODCF0_MASK                         0x00000001
#define _ODCF_ODCF0_LENGTH                       0x00000001

#define _ODCF_ODCF1_POSITION                     0x00000001
#define _ODCF_ODCF1_MASK                         0x00000002
#define _ODCF_ODCF1_LENGTH                       0x00000001

#define _ODCF_ODCF2_POSITION                     0x00000002
#define _ODCF_ODCF2_MASK                         0x00000004
#define _ODCF_ODCF2_LENGTH                       0x00000001

#define _ODCF_ODCF3_POSITION                     0x00000003
#define _ODCF_ODCF3_MASK                         0x00000008
#define _ODCF_ODCF3_LENGTH                       0x00000001

#define _ODCF_ODCF4_POSITION                     0x00000004
#define _ODCF_ODCF4_MASK                         0x00000010
#define _ODCF_ODCF4_LENGTH                       0x00000001

#define _ODCF_ODCF5_POSITION                     0x00000005
#define _ODCF_ODCF5_MASK                         0x00000020
#define _ODCF_ODCF5_LENGTH                       0x00000001

#define _ODCF_ODCF6_POSITION                     0x00000006
#define _ODCF_ODCF6_MASK                         0x00000040
#define _ODCF_ODCF6_LENGTH                       0x00000001

#define _ODCF_ODCF7_POSITION                     0x00000007
#define _ODCF_ODCF7_MASK                         0x00000080
#define _ODCF_ODCF7_LENGTH                       0x00000001

#define _ODCF_ODCF8_POSITION                     0x00000008
#define _ODCF_ODCF8_MASK                         0x00000100
#define _ODCF_ODCF8_LENGTH                       0x00000001

#define _ODCF_ODCF12_POSITION                    0x0000000C
#define _ODCF_ODCF12_MASK                        0x00001000
#define _ODCF_ODCF12_LENGTH                      0x00000001

#define _ODCF_ODCF13_POSITION                    0x0000000D
#define _ODCF_ODCF13_MASK                        0x00002000
#define _ODCF_ODCF13_LENGTH                      0x00000001

#define _ANSELF_ANSF0_POSITION                   0x00000000
#define _ANSELF_ANSF0_MASK                       0x00000001
#define _ANSELF_ANSF0_LENGTH                     0x00000001

#define _ANSELF_ANSF1_POSITION                   0x00000001
#define _ANSELF_ANSF1_MASK                       0x00000002
#define _ANSELF_ANSF1_LENGTH                     0x00000001

#define _ANSELF_ANSF2_POSITION                   0x00000002
#define _ANSELF_ANSF2_MASK                       0x00000004
#define _ANSELF_ANSF2_LENGTH                     0x00000001

#define _ANSELF_ANSF3_POSITION                   0x00000003
#define _ANSELF_ANSF3_MASK                       0x00000008
#define _ANSELF_ANSF3_LENGTH                     0x00000001

#define _ANSELF_ANSF4_POSITION                   0x00000004
#define _ANSELF_ANSF4_MASK                       0x00000010
#define _ANSELF_ANSF4_LENGTH                     0x00000001

#define _ANSELF_ANSF5_POSITION                   0x00000005
#define _ANSELF_ANSF5_MASK                       0x00000020
#define _ANSELF_ANSF5_LENGTH                     0x00000001

#define _ANSELF_ANSF8_POSITION                   0x00000008
#define _ANSELF_ANSF8_MASK                       0x00000100
#define _ANSELF_ANSF8_LENGTH                     0x00000001

#define _ANSELF_ANSF12_POSITION                  0x0000000C
#define _ANSELF_ANSF12_MASK                      0x00001000
#define _ANSELF_ANSF12_LENGTH                    0x00000001

#define _ANSELF_ANSF13_POSITION                  0x0000000D
#define _ANSELF_ANSF13_MASK                      0x00002000
#define _ANSELF_ANSF13_LENGTH                    0x00000001

#define _ANSELF_ANSELF0_POSITION                 0x00000000
#define _ANSELF_ANSELF0_MASK                     0x00000001
#define _ANSELF_ANSELF0_LENGTH                   0x00000001

#define _ANSELF_ANSELF1_POSITION                 0x00000001
#define _ANSELF_ANSELF1_MASK                     0x00000002
#define _ANSELF_ANSELF1_LENGTH                   0x00000001

#define _ANSELF_ANSELF2_POSITION                 0x00000002
#define _ANSELF_ANSELF2_MASK                     0x00000004
#define _ANSELF_ANSELF2_LENGTH                   0x00000001

#define _ANSELF_ANSELF3_POSITION                 0x00000003
#define _ANSELF_ANSELF3_MASK                     0x00000008
#define _ANSELF_ANSELF3_LENGTH                   0x00000001

#define _ANSELF_ANSELF4_POSITION                 0x00000004
#define _ANSELF_ANSELF4_MASK                     0x00000010
#define _ANSELF_ANSELF4_LENGTH                   0x00000001

#define _ANSELF_ANSELF5_POSITION                 0x00000005
#define _ANSELF_ANSELF5_MASK                     0x00000020
#define _ANSELF_ANSELF5_LENGTH                   0x00000001

#define _ANSELF_ANSELF8_POSITION                 0x00000008
#define _ANSELF_ANSELF8_MASK                     0x00000100
#define _ANSELF_ANSELF8_LENGTH                   0x00000001

#define _ANSELF_ANSELF12_POSITION                0x0000000C
#define _ANSELF_ANSELF12_MASK                    0x00001000
#define _ANSELF_ANSELF12_LENGTH                  0x00000001

#define _ANSELF_ANSELF13_POSITION                0x0000000D
#define _ANSELF_ANSELF13_MASK                    0x00002000
#define _ANSELF_ANSELF13_LENGTH                  0x00000001

#define _ANSF_ANSF0_POSITION                     0x00000000
#define _ANSF_ANSF0_MASK                         0x00000001
#define _ANSF_ANSF0_LENGTH                       0x00000001

#define _ANSF_ANSF1_POSITION                     0x00000001
#define _ANSF_ANSF1_MASK                         0x00000002
#define _ANSF_ANSF1_LENGTH                       0x00000001

#define _ANSF_ANSF2_POSITION                     0x00000002
#define _ANSF_ANSF2_MASK                         0x00000004
#define _ANSF_ANSF2_LENGTH                       0x00000001

#define _ANSF_ANSF3_POSITION                     0x00000003
#define _ANSF_ANSF3_MASK                         0x00000008
#define _ANSF_ANSF3_LENGTH                       0x00000001

