MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB406/mcu.h
#define DSSWEN_OFF           0x00FF
#define DSSWEN_ON            0x80FF

/* Register FDEVOPT1 (0x157b0)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDEVOPT1;
#define _FDEVOPT1(x) __attribute__((address(0x157b0),deprecated_definition("consider migrating to #pragma config"),section("__FDEVOPT1.sec"),space(prog))) __prog__ uint16_t _FDEVOPT1 = (x);

/*
** Only one invocation of FDEVOPT1 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDEVOPT1.
** Multiple options may be combined, as shown:
**
** _FDEVOPT1( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Alternate Comparator Input Enable bit:
**     ALTCMPI_ENABLE       C1INC, C2INC and C3INC are on RG9
**     ALTCMPI_DISABLE      C1INC, C2INC, and C3INC are on their standard pin locations
**
**   Tamper Pin Enable bit:
**     TMPRPIN_ON           TMPRN pin function is enabled
**     TMPRPIN_OFF          TMPRN pin function is disabled
**
**   RAM Based Entryption Key Wipe Enable bit:
**     TMPRWIPE_ON          
**     TMPRWIPE_OFF         
**
**   Alternate VREF location Enable:
**     ALTVREF_ALTVREFEN    VREF is on an alternate pin (VREF+ on RB0 and VREF- on RB1)
**     ALTVREF_ALTVREFDIS   VREF is on a default pin (VREF+ on RA10 and VREF- on RA9)
**
*/

#define ALTCMPI_ENABLE       0x001C
#define ALTCMPI_DISABLE      0x001E

#define TMPRPIN_ON           0x001A
#define TMPRPIN_OFF          0x001E

#define TMPRWIPE_ON          0x0016
#define TMPRWIPE_OFF         0x001E

#define ALTVREF_ALTVREFEN    0x000E
#define ALTVREF_ALTVREFDIS   0x001E

/* Register FBTSEQ (0x157fc)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBTSEQ;
#define _FBTSEQ(x) __attribute__((address(0x157fc),deprecated_definition("consider migrating to #pragma config"),section("__FBTSEQ.sec"),space(prog))) __prog__ uint16_t _FBTSEQ = (x);

/*
** Only one invocation of FBTSEQ should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBTSEQ.
** Multiple options may be combined, as shown:
**
** _FBTSEQ( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Relative value defining which partition will be active after devie Reset; the partition containing a lower boot number will be active.:
**     BSEQ_BSEQ            Boot Sequence Number bits
**
**   The one's complement of BSEQ; must be calculated by the user and written during device programming.:
**     IBSEQ_IBSEQ          Inverse Boot Sequence Number bits
**
*/

#define BSEQ_BSEQ            0xF000

#define IBSEQ_IBSEQ          0xFF0FFF

#endif



/*
 * Flash Programming Information
 */

#undef _FLASH_PAGE
#define _FLASH_PAGE 0x200

#undef _FLASH_ROW
#define _FLASH_ROW 0x40

/*
 * Memory Segments Sizes
 */


/*
 * Memory Segments Sizes that are always present
 */

#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __FBOOT_BASE 0x801800
#define __FBOOT_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x4000


/*
 * Single panel memory sizes
 */

#ifndef __DUAL_PARTITION
#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x100
#define __PROGRAM_LENGTH 0x2ae80

#define __FSEC_BASE 0x2af80
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0x2af90
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0x2af94
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0x2af98
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0x2af9c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0x2afa0
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0x2afa4
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0x2afa8
#define __FICD_LENGTH 0x2

#define __FDS_BASE 0x2afac
#define __FDS_LENGTH 0x2

#define __FDEVOPT1_BASE 0x2afb0
#define __FDEVOPT1_LENGTH 0x2

#define __FBTSEQ_BASE 0x2affc
#define __FBTSEQ_LENGTH 0x2

#endif

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x4000


/*
 * Dual panel memory sizes
 */

#ifdef __DUAL_PARTITION
#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x100
#define __PROGRAM_LENGTH 0x15680

#define __FSEC_BASE 0x15780
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0x15790
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0x15794
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0x15798
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0x1579c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0x157a0
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0x157a4
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0x157a8
#define __FICD_LENGTH 0x2

#define __FDS_BASE 0x157ac
#define __FDS_LENGTH 0x2

#define __FDEVOPT1_BASE 0x157b0
#define __FDEVOPT1_LENGTH 0x2

#define __FBTSEQ_BASE 0x157fc
#define __FBTSEQ_LENGTH 0x2

#endif

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x4000


/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_OC1 13
#define _RPOUT_OCM4 16
#define _RPOUT_REFO1 28
#define _RPOUT_CLC1OUT 29
#define _RPOUT_C1OUT 1
#define _RPOUT_SCK1OUT 8
#define _RPOUT_SCK2OUT 11
#define _RPOUT_SCK3OUT 24
#define _RPOUT_OC2 14
#define _RPOUT_OCM5 17
#define _RPOUT_CLC2OUT 30
#define _RPOUT_C2OUT 2
#define _RPOUT_U1TX 3
#define _RPOUT_U2TX 5
#define _RPOUT_U3TX 19
#define _RPOUT_U4TX 21
#define _RPOUT_OC3 15
#define _RPOUT_OCM6 18
#define _RPOUT_C3OUT 26
#define _RPOUT_U1RTS 4
#define _RPOUT_U2RTS 6
#define _RPOUT_U3RTS 20
#define _RPOUT_U4RTS 22
#define _RPOUT_SDO1 7
#define _RPOUT_SDO2 10
#define _RPOUT_SDO3 23
#define _RPOUT_OCM7 27

#endif
